spec/fixtures/files/stripe/customer_with_subscription.json

{
  "id": "cus_ELX3rIGG1ccq1R",
  "object": "customer",
  "account_balance": 0,
  "created": 1547551292,
  "currency": "usd",
  "default_source": "src_1Dspz3HwuhGySQCdSBLSwKG5",
  "delinquent": false,
  "description": null,
  "discount": null,
  "email": "stefan+3@kolizz.com",
  "invoice_prefix": "A13AA87",
  "invoice_settings": {"custom_fields":null,"footer":null},
  "livemode": false,
  "metadata": {},
  "shipping": null,
  "sources": {"object":"list","data":[{"id":"src_1Dspz3HwuhGySQCdSBLSwKG5","object":"source","amount":null,"card":{"exp_month":10,"exp_year":2020,"brand":"Visa","country":"US","cvc_check":"pass","fingerprint":"AFDR1kTX598pXWiQ","funding":"credit","last4":"4242","three_d_secure":"optional","name":null,"address_line1_check":null,"address_zip_check":null,"tokenization_method":null,"dynamic_last4":null},"client_secret":"src_client_secret_ELX3bw85ye0zIdhDjAMfPt5B","created":1547551289,"currency":null,"customer":"cus_ELX3rIGG1ccq1R","flow":"none","livemode":false,"metadata":{},"owner":{"address":null,"email":null,"name":null,"phone":null,"verified_address":null,"verified_email":null,"verified_name":null,"verified_phone":null},"statement_descriptor":null,"status":"chargeable","type":"card","usage":"reusable"}],"has_more":false,"total_count":1,"url":"/v1/customers/cus_ELX3rIGG1ccq1R/sources"},
  "subscriptions": {"object":"list","data":[{"id":"sub_ELX3kRY8b7Rm9e","object":"subscription","application_fee_percent":null,"billing":"charge_automatically","billing_cycle_anchor":1547551293,"billing_thresholds":null,"cancel_at_period_end":false,"canceled_at":null,"created":1547551293,"current_period_end":1550229693,"current_period_start":1547551293,"customer":"cus_ELX3rIGG1ccq1R","days_until_due":null,"default_source":null,"discount":null,"ended_at":null,"items":{"object":"list","data":[{"id":"si_ELX3mQWLGJJ2aC","object":"subscription_item","billing_thresholds":null,"created":1547551293,"metadata":{},"plan":{"id":"climate_offset_3_6_usd_monthly","object":"plan","active":true,"aggregate_usage":null,"amount":360,"billing_scheme":"per_unit","created":1539029173,"currency":"usd","interval":"month","interval_count":1,"livemode":false,"metadata":{},"nickname":null,"product":"prod_Dka9IawzVZYo19","tiers":null,"tiers_mode":null,"transform_usage":null,"trial_period_days":null,"usage_type":"licensed"},"quantity":1,"subscription":"sub_ELX3kRY8b7Rm9e"}],"has_more":false,"total_count":1,"url":"/v1/subscription_items?subscription=sub_ELX3kRY8b7Rm9e"},"livemode":false,"metadata":{},"plan":{"id":"climate_offset_3_6_usd_monthly","object":"plan","active":true,"aggregate_usage":null,"amount":360,"billing_scheme":"per_unit","created":1539029173,"currency":"usd","interval":"month","interval_count":1,"livemode":false,"metadata":{},"nickname":null,"product":"prod_Dka9IawzVZYo19","tiers":null,"tiers_mode":null,"transform_usage":null,"trial_period_days":null,"usage_type":"licensed"},"quantity":1,"start":1547551293,"status":"active","tax_percent":null,"trial_end":null,"trial_start":null}],"has_more":false,"total_count":1,"url":"/v1/customers/cus_ELX3rIGG1ccq1R/subscriptions"},
  "tax_info": null,
  "tax_info_verification": null
}
