spec/fixtures/files/stripe/source_three_d_secure_chargeable.json

{
  "id": "src_1DviDUHwuhGySQCdDp14ia61",
  "object": "source",
  "amount": 360,
  "client_secret": "src_client_secret_EOVDQntf16v7wejps2ef2K5O",
  "created": 1548236416,
  "currency": "usd",
  "flow": "redirect",
  "livemode": false,
  "metadata": {},
  "owner": {"address":{"city":null,"country":null,"line1":null,"line2":null,"postal_code":null,"state":null},"email":null,"name":null,"phone":null,"verified_address":null,"verified_email":null,"verified_name":null,"verified_phone":null},
  "redirect": {"failure_reason":null,"return_url":"http://localhost:3000/users/threedsecure_create","status":"succeeded","url":"https://hooks.stripe.com/redirect/authenticate/src_1DviDUHwuhGySQCdDp14ia61?client_secret=src_client_secret_EOVDQntf16v7wejps2ef2K5O"},
  "statement_descriptor": null,
  "status": "chargeable",
  "three_d_secure": {"card":"src_1DvhyEHwuhGySQCd7HeenHX6","exp_month":10,"exp_year":2020,"last4":"3063","country":"US","brand":"Visa","cvc_check":"pass","funding":"credit","fingerprint":"nzH1WYKwGPJtfUhD","three_d_secure":"required","authenticated":true,"customer":null,"name":null,"address_line1_check":null,"address_zip_check":null,"tokenization_method":null,"dynamic_last4":null},
  "type": "three_d_secure",
  "usage": "single_use"
}
